In [4]:
import pandas as pd

In [6]:
friend_list = [
    ['name',['Chan','Kim','Hong']],
    ['age',[17,20,30]],
    ['job',['std','tea','tea']]
]
df = pd.DataFrame.from_dict(dict(friend_list))

In [7]:
df

   name  age  job
0  Chan   17  std
1   Kim   20  tea
2  Hong   30  tea

현재 나는 Kim와 Hong를 원할때 인덱스를 슬라이싱 할 수 있음

In [9]:
df[1:3]

   name  age  job
1   Kim   20  tea
2  Hong   30  tea

첫 번째 인덱스 부터 3번 인덱스 - 1 까지 라는 내용

In [10]:
df

   name  age  job
0  Chan   17  std
1   Kim   20  tea
2  Hong   30  tea

In [11]:
df = df[1:3]

In [13]:
df # 새로 저장된다.

   name  age  job
1   Kim   20  tea
2  Hong   30  tea

In [14]:
friend_list = [
    ['name',['Chan','Kim','Hong']],
    ['age',[17,20,30]],
    ['job',['std','tea','tea']]
]
df = pd.DataFrame.from_dict(dict(friend_list))

In [15]:
df

   name  age  job
0  Chan   17  std
1   Kim   20  tea
2  Hong   30  tea

우리가 1번 인덱스만 빼고 출력을 원할때 loc를 사용할 수 있다.

In [18]:
df.loc[[0,2]] # 0번 인덱스와 1번 인덱스를 출력

   name  age  job
0  Chan   17  std
2  Hong   30  tea

In [19]:
df

   name  age  job
0  Chan   17  std
1   Kim   20  tea
2  Hong   30  tea

### by column condition

나이가 20살 이상인 사람만 원할때

In [22]:
df[df.age >= 20]

   name  age  job
1   Kim   20  tea
2  Hong   30  tea

나이가 20 이상이고 이름이 Hong 인 데이터만 가져온다.

In [27]:
df[(df.age >= 20) & (df.name == 'Hong')]

   name  age  job
2  Hong   30  tea

## Filter Column

### by index

In [28]:
friend_list = [
    ['name',['Chan','Kim','Hong']],
    ['age',[17,20,30]],
    ['job',['std','tea','tea']]
]
df = pd.DataFrame.from_dict(dict(friend_list))

In [29]:
df

   name  age  job
0  Chan   17  std
1   Kim   20  tea
2  Hong   30  tea

In [30]:
df.iloc[:,0:2]

   name  age
0  Chan   17
1   Kim   20
2  Hong   30

앞 부분은 행 즉 로우 부분이고, 뒷 부분은 컬럼 부분이다.

In [31]:
df.iloc[0:2, 0:2]

   name  age
0  Chan   17
1   Kim   20

## by column name

In [32]:
df = pd.read_csv('friend_list_no_head.csv', header = None, names=['name', 'age', 'job'])

In [33]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

job 라는 컬럼이 필요가 없을 때

In [34]:
df_filter = df[['name', 'age']]

In [35]:
df_filter

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [36]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [38]:
df.filter(items=['age', 'job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [39]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [40]:
df.filter(like='a', axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

컬럼은 1 로우는 0

In [43]:
df.filter(regex='b', axis=1) # 컬럼 내임이 b로만 끝나는 것

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern